In [152]:
x = 3
y = 5
xy = "Best of Luck"

In [153]:
print x - y, xy

-2 Best of Luck

In [154]:
1+2

3

In [155]:
1/2.0

0.5

In [156]:
2.56//5.23

0.0

In [157]:
z = 1

In [158]:
z == 1

True

In [159]:
z < 2

True

In [160]:
print int (7.7)
print int (7)

7
7

In [161]:
print int ('0xaa', 7)
print int ('baba', 17)

ValueError: invalid literal for int() with base 7: '0xaa'

In [ ]:
chr (98)

In [ ]:
ord ('b')

In [ ]:
c = complex('1+6j')
print abs(c)

In [ ]:
print isinstance (1.0, (int, float))

In [ ]:
print cmp(5,6)

In [ ]:
print range(6,18,4)

In [ ]:
string1 = 'hello'
string2 = 'baba'
string3 = 'i miss you'
print (string1 + " " + string2 + " " + string3)

In [ ]:
print ('hello %s') % string1

In [ ]:
print "%s %s" %(string1, string2)

In [ ]:
print"_k"*22

In [ ]:
print "Kiran\nNoman\nMurtaza"

In [ ]:
x = ['zoha', 'rabeea']
k = ['hassan', 'hashim']
z = [x,k]
print z

In [ ]:
a1 = z[-1]
print a1

In [ ]:
names = ['peter','paul','brown','charles','nancy']
print names[0:4]
print names[:4:2]

In [ ]:
high = [11,22,33,44,55,66,77,88,99,100]
print len(high)
print min(high)
print max(high)

In [ ]:
['k','i','r','a','n'] + ['w','a','s','i','f']

In [ ]:
list ('dorathy')

In [ ]:
lst = [10,20,30,40,50,60,70,80,90,99,]
lst1 = [2,4,6,8,10]
lst.append(1)
print lst
print lst.count(99)

In [ ]:
lst2 = [2,4,6,8]
lst3 = [3,5,7,9]
lst2.append(lst3)
print lst2
print lst2.insert(3,'jenga')

In [ ]:
stress = [1,11,111,1111,11111,111111]
double = [2,22,222,2222,22222,222222]
stress.append(double)
print stress

In [ ]:
stress.insert(3,'zen')
print stress

In [ ]:
stress.reverse()
print stress

In [ ]:
stress.sort()
print stress

In [ ]:
languages = ['english','french','urdu','spanish','turkish']
languages.sort()
print languages
languages.sort(reverse=True)
print languages

In [ ]:
nvm = divmod(6,3)
print nvm
print type(nvm)

In [ ]:
tup1 = tuple([1,2,3])
tup2 = tuple('hello')
print tup1
print tup2

In [ ]:
print tup1[2]
tup3 = tup2[1:]
print tup3

In [ ]:
(a,b,c) = ('bubbles', 'buttercup', 'blossom')
print a,b,c

In [ ]:
s = tuple('honeybunny')
print s

In [ ]:
s.count('n')

In [ ]:
s.index('n')

In [ ]:
set1 = set(['ww','ww','ww','xx','xx','ll'])
print set1

In [ ]:
sete = set([2,3,5,7,5,8])
setr = set([5,4,3,8,5,2])
sete.union(setr)

In [ ]:
sete.intersection(setr)

In [ ]:
sete.difference(setr)

In [ ]:
sete.symmetric_difference(setr)

In [ ]:
q = 6
if q < 5:
    print "kiran"
else:
    print "salt"

In [ ]:
a = 10
s = 12
if a>b:
    print "a>b"
elif a==11:
    print "nay"
elif s==12:
    print "yay"
else:
    print "meh"

In [ ]:
for i in range(5):
    print i

In [ ]:
list_of_lists = [[2,4,6] , [8,10,12] , [14,16,18]]
for fist in list_of_lists:
    print fist

In [ ]:
for x in fist:
    print x

In [ ]:
for i in range(8):
    if i>4:
        print 'short'
        continue
    elif i<6:
        print 'long'

In [ ]:
res = []
for i in range(0,4):
    x = 3*i
    res.append(x)
print res

In [ ]:
[3*x for x in range(0,4)]

In [ ]:
import pandas as pd
import datetime

In [ ]:
dt = datetime.datetime(2017,11,4)
end = datetime.datetime(2017,11,9)
step = datetime.timedelta(days=1)
dates = []

In [ ]:
#I DID NOT UNDERSTAND THIS AT ALL, WHEN I USED STRF IT DIDNT PICK UP
while dt < end:
    dates.append(dt.strftime('%m-%d'))
    dt += step

In [ ]:
dates

In [ ]:
d = {'date': ['11-01','11-02','11-03'], 'Niagara':[13,14,15], 'Montreal':[-1,2,0], 'Regina':[-10,-14,-12]}
d

In [ ]:
temps = pd.DataFrame(d)

In [ ]:
ntemp = temps['Niagara']
print ntemp

In [ ]:
temps

In [ ]:
# THIS CELL DID NOT WORK NO MATTER WHAT I DID, PLEASE CHECKE
temps = temps.set_index('date')

In [ ]:
medals=pd.read_csv('../data/olympicmedals.csv')

In [ ]:
medals.tail()

In [162]:
medals.Sport.value_counts()

Aquatics             3828
Athletics            3448
Rowing               2523
Gymnastics           2214
Fencing              1547
Football             1387
Hockey               1325
Wrestling            1140
Shooting             1105
Sailing              1061
Cycling              1025
Canoe / Kayak        1002
Basketball            940
Volleyball            910
Equestrian            894
Handball              886
Boxing                842
Weightlifting         548
Judo                  435
Baseball              335
Archery               305
Tennis                272
Rugby                 192
Softball              180
Modern Pentathlon     174
Badminton             120
Table Tennis          120
Tug of War             94
Taekwondo              80
Polo                   66
Lacrosse               59
Golf                   30
Skating                27
Ice Hockey             27
Cricket                24
Triathlon              18
Rackets                10
Croquet                 8
Water Motorsports       5
Basque Pelota           4
Roque                   3
Jeu de paume            3
Name: Sport, dtype: int64

In [163]:
import pandas as pd

In [164]:
from pandas import Series, DataFrame

In [165]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

In [166]:
obj = pd.Series([1,4,7,0])

In [168]:
obj2 = pd.Series([2,4,5,7], index=['a','b','c','d'])
obj2

a    2
b    4
c    5
d    7
dtype: int64

In [169]:
obj2['a'] = 8
obj2[['d','a','b']]

d    7
a    8
b    4
dtype: int64

In [170]:
kdata = {'Karachi' : 5000, 'Lahore' : 6000, 'Islamabad' : 8000, 'Multan' :2000}
obj3 = pd.Series(kdata)
obj3

Islamabad    8000
Karachi      5000
Lahore       6000
Multan       2000
dtype: int64

In [171]:
Cities = ['Karachi','Lahore','Islamabad','Multan']
obj4 = pd.Series(kdata, index=Cities)
obj4

Karachi      5000
Lahore       6000
Islamabad    8000
Multan       2000
dtype: int64

In [173]:
pd.isnull(obj4)
pd.notnull(obj4)

Karachi      True
Lahore       True
Islamabad    True
Multan       True
dtype: bool

In [174]:
obj3 + obj4

Islamabad    16000
Karachi      10000
Lahore       12000
Multan        4000
dtype: int64

In [175]:
data = {'city': ['karachi', 'Karachi', 'Karachi', 'Lahore', 'Lahore', 'Lahore'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [45, 46, 47, 45, 46, 47]}
frame = pd.DataFrame(data)
frame

      city  pop  year
0  karachi   45  2000
1  Karachi   46  2001
2  Karachi   47  2002
3   Lahore   45  2001
4   Lahore   46  2002
5   Lahore   47  2003

In [176]:
frame = pd.DataFrame(data, columns=['city','pop','year'], index=['a', 'b', 'c', 'd', 'e', 'f'])
frame

      city  pop  year
a  karachi   45  2000
b  Karachi   46  2001
c  Karachi   47  2002
d   Lahore   45  2001
e   Lahore   46  2002
f   Lahore   47  2003

In [177]:
frame2 = pd.DataFrame(data, columns=['year', 'city', 'pop', 'debt'],
                      index=['a', 'b', 'c', 'd', 'e', 'f'])
frame2

   year     city  pop debt
a  2000  karachi   45  NaN
b  2001  Karachi   46  NaN
c  2002  Karachi   47  NaN
d  2001   Lahore   45  NaN
e  2002   Lahore   46  NaN
f  2003   Lahore   47  NaN

In [178]:
frame2['debt'] = np.arange(6.0)
frame2

   year     city  pop  debt
a  2000  karachi   45   0.0
b  2001  Karachi   46   1.0
c  2002  Karachi   47   2.0
d  2001   Lahore   45   3.0
e  2002   Lahore   46   4.0
f  2003   Lahore   47   5.0

In [180]:
frame2.T

            a        b        c       d       e       f
year     2000     2001     2002    2001    2002    2003
city  karachi  Karachi  Karachi  Lahore  Lahore  Lahore
pop        45       46       47      45      46      47
debt        0        1        2       3       4       5

In [181]:
#I DID NOT UNDERSTAND .RESHAPE, I DID HIT AND TRIAL AND ENDED UP AT 4, 3
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=['a', 'c', 'd', 'e'],
                     columns=['ontario', 'montreal', 'nanawut'])
frame
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   ontario  montreal  nanawut
a      0.0       1.0      2.0
b      NaN       NaN      NaN
c      3.0       4.0      5.0
d      6.0       7.0      8.0

In [182]:
obj = pd.Series(np.arange(3.), index=['c', 'd', 'e'])
obj
new_obj = obj.drop('e')
new_obj

c    0.0
d    1.0
dtype: float64

In [183]:
obj

c    0.0
d    1.0
e    2.0
dtype: float64

In [184]:
oobj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
oobj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [186]:
oobj['c']

2.0

In [187]:
oobj['c']

2.0

In [188]:
oobj[2:4]

c    2.0
d    3.0
dtype: float64

In [189]:
oobj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [190]:
oobj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [191]:
oobj[oobj < 2]

a    0.0
b    1.0
dtype: float64

In [193]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['table', 'chair', 'dresser', 'bed'],
                    columns=['one', 'two', 'three', 'four'])
data

         one  two  three  four
table      0    1      2     3
chair      4    5      6     7
dresser    8    9     10    11
bed       12   13     14    15

In [194]:
data['two']

table       1
chair       5
dresser     9
bed        13
Name: two, dtype: int64

In [195]:
data[['three', 'one']]

         three  one
table        2    0
chair        6    4
dresser     10    8
bed         14   12

In [200]:
data.loc['chair', ['two', 'three']]

two      5
three    6
Name: chair, dtype: int64

In [198]:
data.iloc[2, [3, 0, 1]]
data.iloc[2]
data.iloc[[1, 2], [3, 0, 1]]

         four  one  two
chair       7    4    5
dresser    11    8    9

In [199]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [202]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['ontario', 'montreal', 'nwt'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['sesketuan', 'alberta', 'BC', 'nanawut'])
df2

             b     d     e
sesketuan  0.0   1.0   2.0
alberta    3.0   4.0   5.0
BC         6.0   7.0   8.0
nanawut    9.0  10.0  11.0

In [203]:
df1

            b    c    d
ontario   0.0  1.0  2.0
montreal  3.0  4.0  5.0
nwt       6.0  7.0  8.0

In [204]:
df1 + df2

            b   c   d   e
BC        NaN NaN NaN NaN
alberta   NaN NaN NaN NaN
montreal  NaN NaN NaN NaN
nanawut   NaN NaN NaN NaN
nwt       NaN NaN NaN NaN
ontario   NaN NaN NaN NaN
sesketuan NaN NaN NaN NaN

In [205]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('abc'),
                     index=['table', 'chair', 'bed', 'dresser'])
frame
np.abs(frame)

                a         b         c
table    0.204708  0.478943  0.519439
chair    0.555730  1.965781  1.393406
bed      0.092908  0.281746  0.769023
dresser  1.246435  1.007189  1.296221

In [208]:
d = lambda x: x.max() - x.min()
frame.apply(d)

a    1.802165
b    1.684034
c    2.689627
dtype: float64

In [209]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(d)

a    1.802165
b    1.684034
c    2.689627
dtype: float64

In [212]:
format = lambda x: '%.2f' % x
frame.applymap(format)

             a     b      c
table    -0.20  0.48  -0.52
chair    -0.56  1.97   1.39
bed       0.09  0.28   0.77
dresser   1.25  1.01  -1.30

In [213]:
df = pd.DataFrame([[2.6, np.nan], [4.2, -2.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  2.60  NaN
b  4.20 -2.5
c   NaN  NaN
d  0.75 -1.3

In [214]:
df.sum()

one    7.55
two   -3.80
dtype: float64

In [215]:
df.describe()

            one       two
count  3.000000  2.000000
mean   2.516667 -1.900000
std    1.726509  0.848528
min    0.750000 -2.500000
25%    1.675000 -2.200000
50%    2.600000 -1.900000
75%    3.400000 -1.600000
max    4.200000 -1.300000

In [217]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [218]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2017-11-13 -0.004008 -0.002257 -0.005095  0.000715
2017-11-14 -0.015118  0.000244  0.003302  0.001430
2017-11-15 -0.013190 -0.004961 -0.012022 -0.007772
2017-11-16  0.011947  0.011353  0.013732  0.002651
2017-11-17 -0.005552 -0.012988 -0.001006 -0.009615

In [219]:
returns.corr()
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000256  0.000101  0.000068  0.000089
GOOG  0.000101  0.000231  0.000069  0.000102
IBM   0.000068  0.000069  0.000140  0.000078
MSFT  0.000089  0.000102  0.000078  0.000198

In [220]:
obj = pd.Series(['x', 'a', 'g', 'a', 'x', 'b', 'b', 'f', 'f', 'g'])

In [221]:
uniques = obj.unique()
uniques

array(['x', 'a', 'g', 'b', 'f'], dtype=object)

In [222]:
import pandas as pd

In [223]:
df = pd.read_csv('../data/gapminder.tsv', delimiter='\t')

In [224]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [225]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
country      1704 non-null object
continent    1704 non-null object
year         1704 non-null int64
lifeExp      1704 non-null float64
pop          1704 non-null int64
gdpPercap    1704 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 79.9+ KB

In [226]:
df.loc[[0, 99, 999], ['country', 'lifeExp', 'gdpPercap']]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [227]:
(df.groupby(['year', 'continent'])[['lifeExp', 'gdpPercap']].mean()).reset_index()

    year continent    lifeExp     gdpPercap
0   1952    Africa  39.135500   1252.572466
1   1952  Americas  53.279840   4079.062552
2   1952      Asia  46.314394   5195.484004
3   1952    Europe  64.408500   5661.057435
4   1952   Oceania  69.255000  10298.085650
5   1957    Africa  41.266346   1385.236062
6   1957  Americas  55.960280   4616.043733
7   1957      Asia  49.318544   5787.732940
8   1957    Europe  66.703067   6963.012816
9   1957   Oceania  70.295000  11598.522455
..   ...       ...        ...           ...
50  2002    Africa  53.325231   2599.385159
51  2002  Americas  72.422040   9287.677107
52  2002      Asia  69.233879  10174.090397
53  2002    Europe  76.700600  21711.732422
54  2002   Oceania  79.740000  26938.778040
55  2007    Africa  54.806038   3089.032605
56  2007  Americas  73.608120  11003.031625
57  2007      Asia  70.728485  12473.026870
58  2007    Europe  77.648600  25054.481636
59  2007   Oceania  80.719500  29810.188275

[60 rows x 4 columns]